{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark Valentine-themed color tokens and global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component coordinating scene progression, scroll jumps, and asset preloading.",
  "frontend/src/components/valentine/assets.ts": "Exports paths for Valentine-themed image and audio assets.",
  "frontend/src/components/valentine/ContinuePrompt.tsx": "Floating continue button with bounce animation that triggers scene-advance callbacks.",
  "frontend/src/components/valentine/LetterContent.ts": "Exports exact multiline Valentine letter text for display.",
  "frontend/src/components/valentine/LoadingOverlay.tsx": "Full‑screen loading overlay with heart icon and progress bar.",
  "frontend/src/components/valentine/MovieTicketScene.tsx": "Interactive bouncing ticket scene that becomes catchable when unlocked and triggers completion after capture.",
  "frontend/src/components/valentine/OpeningMailboxScene.tsx": "Mailbox→envelope→letter reveal sequence with ambient audio and continue prompt.",
  "frontend/src/components/valentine/ScratchFrameScene.tsx": "React scene showing a framed image with a scratch-off overlay that reveals a Valentine message once scratched past 60%.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useAmbientAudio.ts": "Hook to preload, start, and stop looping ambient audio.",
  "frontend/src/hooks/useAssetPreloader.ts": "Preloads images and audio, tracking loading state and progress.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/hooks/useScratchOffCanvas.ts": "Implements scratch-off canvas logic that tracks pointer interactions and scratch completion percentage.",
  "frontend/src/index.css": "Tailwind-based global styles defining Valentine color palette, fonts, utilities, and animations.",
  "frontend/src/main.tsx": "Entrypoint initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, playful fonts, radius utilities, shadows, and multiple float/bounce/unfold animations with keyframes.",
  "project_state.json": "Defines the project’s schema, current UX issues, aesthetic direction shift, and feature requirements for a playful Valentine’s interactive single‑page experience."
}