{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing two Valentine experience updates and affected components.",
  "frontend-file-summaries.txt": "Text file summarizing each frontend component’s role in the Valentine experience.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark color palettes and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app into the root div.",
  "frontend/src/App.tsx": "Main app orchestrating scene flow, preload handling, and scroll transitions between sections.",
  "frontend/src/components/valentine/assets.ts": "Exports paths for all Valentine-themed image and audio assets.",
  "frontend/src/components/valentine/ContinuePrompt.tsx": "Floating continue button prompting users to advance to the next scene.",
  "frontend/src/components/valentine/LetterContent.ts": "Exports the static valentine letter text with preserved formatting.",
  "frontend/src/components/valentine/LoadingOverlay.tsx": "Full‑screen loading overlay showing a progress bar and animated heart during asset preload.",
  "frontend/src/components/valentine/MovieTicketScene.tsx": "Interactive bouncing ticket scene with catch‑to‑reveal behavior and continue prompt.",
  "frontend/src/components/valentine/OpeningMailboxScene.tsx": "Opening mailbox interaction revealing an envelope and unfolding letter with ambient audio and continue prompt.",
  "frontend/src/components/valentine/ScratchFrameScene.tsx": "React component rendering a scratch-off framed illustration that unlocks once the user scratches past 60%.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAmbientAudio.ts": "Hook for managing looping background audio playback using the Valentine audio asset.",
  "frontend/src/hooks/useAssetPreloader.ts": "Preloads images and audio assets while tracking loading progress.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries exist.",
  "frontend/src/hooks/useScratchOffCanvas.ts": "Hook implementing a scratch-off canvas overlay with percentage tracking and pointer-based erasing.",
  "frontend/src/index.css": "Tailwind setup and custom Valentine-themed color, font, and animation utilities.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color tokens, playful fonts, extended shadows, and multiple animation/keyframe definitions for floating and reveal effects.",
  "project_state.json": "Defines the project’s current state, listing required aesthetic changes, critical usability issues, and the need to replace the couple illustration while maintaining a playful Valentine’s experience."
}