{
  "backend/main.mo": "Empty Motoko actor definition with no methods or logic.",
  "feature_evidence.json": "JSON report listing implemented Valentine experience features, associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all key frontend Valentine experience files.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark Valentine-themed color system and global styling.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component coordinating all Valentine scenes, asset preloading, autoplay-safe ambient audio, and global music controls.",
  "frontend/src/components/valentine/assets.ts": "Exports paths to all Valentine scene image and audio assets.",
  "frontend/src/components/valentine/BackgroundMusicControl.tsx": "Floating mute/unmute button using shadcn UI and lucide icons to toggle background audio.",
  "frontend/src/components/valentine/ContinuePrompt.tsx": "Centered bouncing continue button that triggers scene-to-scene scrolling.",
  "frontend/src/components/valentine/LetterContent.ts": "Exports the full static Valentine letter text for display in the mailbox scene.",
  "frontend/src/components/valentine/LoadingOverlay.tsx": "Full‑screen loading screen with progress bar and animated heart shown while assets preload.",
  "frontend/src/components/valentine/MovieTicketScene.tsx": "Drag‑and‑drop mini‑game where users move a ticket into a target box to reveal event info before progressing.",
  "frontend/src/components/valentine/OpeningMailboxScene.tsx": "Interactive mailbox that reveals an envelope and unfolding letter, then enables continuation to the next scene.",
  "frontend/src/components/valentine/ScratchFrameScene.tsx": "Renders an unlockable framed illustration with a scratch-off canvas and sparkle animations triggered after sufficient scratching.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and manages an authenticated or anonymous backend actor, refreshing on identity changes.",
  "frontend/src/hooks/useAmbientAudio.ts": "Manages looping background audio with readiness, autoplay handling, and mute toggling.",
  "frontend/src/hooks/useAssetPreloader.ts": "Preloads Valentine assets and tracks loading progress for images and audio.",
  "frontend/src/hooks/useInternetIdentity.ts": "Supplies Internet Identity context, handling login, logout, identity loading, and related auth state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting no backend queries are needed.",
  "frontend/src/hooks/useScratchOffCanvas.ts": "Implements scratch-off interaction over a canvas, tracking scratched percentage and pointer events.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom Valentine's colors, fonts, utilities, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color palette, playful fonts, radius, shadows, and numerous float/bounce/sparkle animations with keyframes.",
  "project_state.json": "Tracks project state, requirements, known issues, and design direction for a playful Valentine’s interactive page, plus notes on image edits and accessibility fixes."
}