{
  "kind": "build_request",
  "title": "Fix broken scrolling and letter readability; shift Valentine experience from vintage to fun/playful",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Fix page scrolling and progression so the user can always scroll through the single-page experience (mailbox/letter → movie ticket → scratch frame) on desktop and mobile, without getting stuck before or after the letter is revealed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "again im not able to scroll ... AND I CANT SCROLL AFTERWAARDS"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load, the page is scrollable (user can scroll down/up with mouse wheel, trackpad, touch swipe).",
        "After opening the envelope and revealing the letter, the user can scroll past the mailbox/letter section to reach the movie ticket section.",
        "After completing the ticket interaction, the user can scroll to the scratch frame section.",
        "No scene transition relies on impossible scroll conditions (e.g., hidden/removed sections causing no scroll height).",
        "The experience remains reliably repeatable after browser refresh (no stuck state where scrolling is disabled or progression cannot occur)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Make the letter fully readable across devices by improving layout, sizing, and contrast while preserving the exact letter text (including line breaks and emojis) from frontend/src/components/valentine/LetterContent.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I CANT EVE NREAD MY LETTER!!!!!"
        ]
      },
      "acceptanceCriteria": [
        "The entire letter content is readable without text blending into the background (sufficient contrast).",
        "On common mobile viewports (e.g., ~390x844), the letter text is not clipped and can be read comfortably (no overlapping layers hiding text).",
        "If the letter area uses an internal scroll, it must be obvious and usable; otherwise, the main page scroll must allow reading the full content.",
        "The rendered message matches LETTER_CONTENT exactly (no edits to spelling/punctuation/line breaks/emojis)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Change the overall visual vibe from moody vintage to fun/playful Valentine’s style across all scenes (mailbox, ticket, scratch frame) by updating global styles (colors/typography/background treatments/animations) and scene styling to remove the heavy vintage look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I HATE THE VIBE MAKE IT FUN NOT VINTAGE."
        ]
      },
      "acceptanceCriteria": [
        "The primary look and feel is bright/fun/playful Valentine’s (not moody/vintage): lighter palette, clearer typography, and upbeat visual energy.",
        "Vintage-specific styling cues are minimized/removed where they dominate (e.g., dark vignette overlays, old-paper heaviness, candle-flicker mood), while keeping the same interactive structure and steps.",
        "All scenes share a consistent fun/playful theme (no mix of playful + heavy vintage elements).",
        "No user-facing text added for this change uses non-English wording."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the “Scroll to continue” UX so it works reliably: once a section is completed, provide a dependable way to proceed (scroll detection that works with the actual document flow and/or a clear continue affordance) and ensure the indicator never appears when progression is blocked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "AND I CANT SCROLL AFTERWAARDS"
        ]
      },
      "acceptanceCriteria": [
        "After the letter is revealed, the user receives a reliable prompt/affordance to proceed and can reach the next section without getting stuck.",
        "After the ticket details are revealed, the user receives a reliable prompt/affordance to proceed and can reach the scratch frame section without getting stuck.",
        "The “Scroll to continue” indicator does not appear in situations where the next section cannot be reached (e.g., next section not mounted / no scroll space).",
        "Works with touch scrolling on mobile Safari/Chrome and with wheel/trackpad scrolling on desktop browsers."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend remains single-actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not change the Valentine letter message content in frontend/src/components/valentine/LetterContent.ts.",
    "Do not add new interactive sections beyond mailbox/letter, movie ticket, and scratch frame.",
    "Do not introduce third-party authentication providers or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}