{
  "kind": "build_request",
  "title": "Replace the scratch-off couple selfie illustration so it matches the couple and is actually updated in the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Replace the scratch-off revealed couple illustration with a new comic-like selfie illustration that matches the specified couple details (Punjabi, light-brown/lighter skin tones, mid‑20s; sitting on a sofa; selfie pose; she has long black hair with no bangs, brown eyes, red off‑shoulder full‑sleeve top, smiling with teeth; he has a shorter/small beard, dark blue sweater, red Sikh turban/dastaar, smiling without showing teeth; he is holding her in his arms), with warm romantic/candlelit lighting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the selfie again doesnt look like us you didnt change"
        ]
      },
      "acceptanceCriteria": [
        "A new static image exists under frontend/public/assets/generated with the agreed filename and dimensions.",
        "The illustration clearly reflects all requested appearance/outfit/pose details (hair/no bangs, turban color, sweater color, smiles, sofa selfie composition, arms holding pose).",
        "The illustration style is comic-like (slightly illustrated but still recognizable) with warm romantic lighting."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure the scratch-off scene displays the newly replaced couple illustration (and not a cached/previous version) by updating the Valentine asset reference used by ScratchFrameScene (via frontend/src/components/valentine/assets.ts) to point to the new generated filename.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the selfie again doesnt look like us you didnt change"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/valentine/assets.ts references the new couple illustration filename (not the previous one).",
        "ScratchFrameScene renders the updated illustration from the new local static asset path.",
        "Hard refresh and normal refresh both show the updated illustration reliably (no old image persists due to caching)."
      ]
    }
  ],
  "constraints": [
    "Do not fetch images through the backend; use local static assets under frontend/public/assets/generated.",
    "Do not edit any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend must remain a single Motoko actor; do not add additional backend services."
  ],
  "nonGoals": [
    "Do not change the letter text content in frontend/src/components/valentine/LetterContent.ts.",
    "Do not redesign the mailbox or movie ticket interactions beyond what is required to confirm the updated selfie image is shown."
  ],
  "imageRequirements": {
    "required": [
      "Comic-like romantic couple selfie on a sofa, warm candlelit glow, Punjabi mid‑20s couple; she long black hair (no bangs), brown eyes, red off‑shoulder full‑sleeve top, smiling with teeth; he dark blue sweater, red Sikh turban (dastaar), shorter/small beard, smiling without showing teeth; he holding her in his arms (couple-illustration-v2.dim_1400x1000.png)"
    ],
    "edits": [
      "Update the couple selfie illustration so it matches the specified couple details and is visibly different from the current image (couple-illustration.dim_1400x1000.png > couple-illustration-v2.dim_1400x1000.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}