{
  "kind": "build_request",
  "title": "Add site-wide background music and update turban detail in scratch-off illustration",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Ensure a background song plays across the entire Valentine single-page experience (not just within the mailbox scene), looping continuously and working on both desktop and mobile within browser autoplay restrictions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you please put a song in the background"
        ]
      },
      "acceptanceCriteria": [
        "Background music can be started successfully on both desktop and mobile (e.g., after the first user gesture if autoplay is blocked).",
        "Once started, the music loops and continues playing while the user scrolls through Mailbox → Movie Ticket → Scratch Frame scenes without restarting between scenes.",
        "Provide a simple on-screen control to mute/unmute (user-facing text in English).",
        "No console/runtime errors occur if audio playback is blocked; the app remains usable."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Update the scratch-off revealed couple illustration so the guy’s turban is plain dark red with no golden element in the center, while keeping the rest of the illustration the same, and update the app to reference the new image filename to avoid caching old versions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "in the cartoon picture remove the golden thing in the center of the turban but keep the rest the same. keep his turban plain dark red"
        ]
      },
      "acceptanceCriteria": [
        "A newly generated/revised couple illustration image exists with the center golden turban element removed and the turban rendered as plain dark red.",
        "`frontend/src/components/valentine/assets.ts` is updated so `ASSETS.coupleIllustration` points to the new filename (not the prior cached one).",
        "The ScratchFrameScene displays the updated illustration after refresh (no old/cached image visible)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under the immutable frontend paths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Do not fetch images through the backend; keep static assets local under `frontend/public/assets/generated`."
  ],
  "nonGoals": [
    "Changing the letter content or wording in any scene.",
    "Altering the scratch-off mechanics/threshold or other character details beyond the turban center ornament removal and making the turban plain dark red."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Remove the golden element in the center of the turban; keep everything else the same; make the turban plain dark red (couple-illustration-v4.dim_1400x1000.png > couple-illustration-v5.dim_1400x1000.png)"
    ]
  }
}