{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update scratch-off couple illustration asset and wire it into the Valentine scratch scene",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add the new comic-like candlelit couple selfie illustration as a local static generated asset with the agreed filename and dimensions.",
      "acceptanceCriteria": [
        "A new static image exists under frontend/public/assets/generated with the agreed filename and dimensions.",
        "The illustration clearly reflects all requested appearance/outfit/pose details (hair/no bangs, turban color, sweater color, smiles, sofa selfie composition, arms holding pose).",
        "The illustration style is comic-like (slightly illustrated but still recognizable) with warm romantic lighting."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/couple-illustration-v2.dim_1400x1000.png",
          "operation": "create",
          "description": "Add the new generated static image asset matching the specified Punjabi mid‑20s couple selfie details (sofa, selfie pose, her red off‑shoulder full‑sleeve top + long black hair no bangs + teeth smile; him dark blue sweater + red Sikh turban/dastaar + small beard + closed-mouth smile; warm romantic/candlelit lighting)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Update ScratchFrameScene’s Valentine asset reference to use the new couple illustration filename and ensure the updated image consistently appears (no stale cached version).",
      "acceptanceCriteria": [
        "frontend/src/components/valentine/assets.ts references the new couple illustration filename (not the previous one).",
        "ScratchFrameScene renders the updated illustration from the new local static asset path.",
        "Hard refresh and normal refresh both show the updated illustration reliably (no old image persists due to caching)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/assets.ts",
          "operation": "modify",
          "description": "Update ASSETS.coupleIllustration to reference the new local static asset filename at frontend/public/assets/generated/couple-illustration-v2.dim_1400x1000.png, replacing the previous couple-illustration.dim_1400x1000.png (filename change provides cache busting for normal and hard refresh)."
        }
      ]
    }
  ]
}